
## Terraform plan for environment: `int`

**Commit:** 8241e85cf4b79da900d6bac96a285121a857cebd


**API version:** 4b7d88faf5
**CLI version:** 4b7d88faf5
**Selfserve version:** 4b7d88faf5
**Internal version:** 4b7d88faf5
**search version:** release-v5.14.1

### Plan summary

`6 to add, 2 to change, 0 to destroy`

**🆕 Creates**

```tf
module.service.aws_cloudwatch_log_group.this["liquibase"]
module.service.aws_cloudwatch_log_group.this["search"]
module.service.module.batch.aws_batch_job_definition.this["liquibase"]
module.service.module.batch.aws_batch_job_definition.this["search"]
module.service.module.cloudwatch_log-metric-filter["liquibase"].aws_cloudwatch_log_metric_filter.this[0]
module.service.module.cloudwatch_log-metric-filter["search"].aws_cloudwatch_log_metric_filter.this[0]
```
**📖 Reads**

```tf
module.service.module.eventbridge.data.aws_iam_policy_document.additional_inline[0]
```
**🔄 Updates**

```tf
module.service.aws_cloudwatch_dashboard.this
module.service.module.eventbridge.aws_iam_policy.additional_inline[0]
```


----

<details data-gh-workflow="int-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.service.aws_cloudwatch_dashboard.this will be updated in-place
  ~ resource "aws_cloudwatch_dashboard" "this" {
      ~ dashboard_body = jsonencode(
          ~ {
              ~ widgets = [
                    # (1 unchanged element hidden)
                    {
                        height     = 6
                        properties = {
                            query   = <<-EOT
                                SOURCE '/aws/events/vol-app-int-failures' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                            region  = "eu-west-1"
                            stacked = false
                            title   = "Batch failure logs"
                            view    = "table"
                        }
                        type       = "log"
                        width      = 18
                        x          = 12
                        y          = 6
                    },
                  ~ {
                      ~ properties = {
                          ~ metrics = [
                                # (43 unchanged elements hidden)
                                [
                                    "AWS/Logs",
                                    "IncomingLogEvents",
                                    "LogGroupName",
                                    "/aws/batch/vol-app-int-transxchange-consumer",
                                ],
                              + [
                                  + "AWS/Logs",
                                  + "IncomingLogEvents",
                                  + "LogGroupName",
                                  + "/aws/batch/vol-app-int-liquibase",
                                ],
                              + [
                                  + "AWS/Logs",
                                  + "IncomingLogEvents",
                                  + "LogGroupName",
                                  + "/aws/batch/vol-app-int-search",
                                ],
                            ]
                            # (4 unchanged attributes hidden)
                        }
                        # (5 unchanged attributes hidden)
                    },
                    {
                        height     = 1
                        properties = {
                            query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-ch-vs-olcs-diffs' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                            region  = "eu-west-1"
                            stacked = false
                            title   = "ch-vs-olcs-diffs-logs"
                            view    = "table"
                        }
                        type       = "log"
                        width      = 6
                        x          = 0
                        y          = 0
                    },
                    # (42 unchanged elements hidden)
                    {
                        height     = 1
                        properties = {
                            query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-transxchange-consumer' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                            region  = "eu-west-1"
                            stacked = false
                            title   = "transxchange-consumer-logs"
                            view    = "table"
                        }
                        type       = "log"
                        width      = 6
                        x          = 0
                        y          = 0
                    },
                  + {
                      + height     = 1
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-liquibase' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "liquibase-logs"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 6
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 1
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-int-search' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "search-logs"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 6
                      + x          = 0
                      + y          = 0
                    },
                ]
            }
        )
        id             = "batch-vol-app-int"
        # (2 unchanged attributes hidden)
    }

  # module.service.aws_cloudwatch_log_group.this["liquibase"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-liquibase"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_cloudwatch_log_group.this["search"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-int-search"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["liquibase"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-liquibase"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 300
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["search"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-int-search"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "int"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 300
        }
    }

  # module.service.module.cloudwatch_log-metric-filter["liquibase"].aws_cloudwatch_log_metric_filter.this[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "this" {
      + id             = (known after apply)
      + log_group_name = "/aws/batch/vol-app-int-liquibase"
      + name           = "liquibase"
      + pattern        = "%ERROR%"

      + metric_transformation {
          + name      = "liquibase"
          + namespace = "vol-app-int-batch-errors"
          + unit      = "None"
          + value     = "1"
        }
    }

  # module.service.module.cloudwatch_log-metric-filter["search"].aws_cloudwatch_log_metric_filter.this[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "this" {
      + id             = (known after apply)
      + log_group_name = "/aws/batch/vol-app-int-search"
      + name           = "search"
      + pattern        = "%ERROR%"

      + metric_transformation {
          + name      = "search"
          + namespace = "vol-app-int-batch-errors"
          + unit      = "None"
          + value     = "1"
        }
    }

  # module.service.module.eventbridge.data.aws_iam_policy_document.additional_inline[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "additional_inline" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "batch:SubmitJob",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-cancel-unsubmitted-bilateral:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-ch-vs-olcs-diffs:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-clean-up-variations:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-close-expired-windows:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-cns:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-company-profile-dlq:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-create-psv-licence-surrender-task:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-delete:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-populate:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-postcheck:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-precheck:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-database-maintenance:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-digital-continuation-reminders:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-duplicate-vehicle-warning:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-enqueue-ch-compare:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-expire-bus-registration:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-flag-urgent-tasks:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-import-users-from-csv:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-inspection-request-email:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-interim-end-date-enforcement:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-international-goods-export:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-last-tm-letter:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-licence-status-rules:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-mark-expired-permits:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-cl:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-company-profile:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-inbox:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-insolvency-dlq:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-insolvency:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-ntu:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-community-licences:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-disc-generation:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-disc-print:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-ecmt-accept:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-general:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-irhp-allocate:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-permit-generation:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-permit-print:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-print:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-psv-operator-list-export:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-remove-read-audit:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-resolve-payments:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-system-parameter:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-transxchange-consumer:77",
              + "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-int-default",
              + "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-int-liquibase",
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "batch"
        }
    }

  # module.service.module.eventbridge.aws_iam_policy.additional_inline[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional_inline" {
        id               = "arn:aws:iam::054614622558:policy/vol-app-int-batch-scheduler-inline"
        name             = "vol-app-int-batch-scheduler-inline"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "batch:SubmitJob"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-int-liquibase",
                          - "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-int-default",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-transxchange-consumer:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-system-parameter:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-resolve-payments:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-remove-read-audit:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-psv-operator-list-export:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-print:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-permit-print:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-permit-generation:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-irhp-allocate:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-general:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-ecmt-accept:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-disc-print:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-disc-generation:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-community-licences:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-ntu:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-insolvency:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-insolvency-dlq:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-inbox:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-company-profile:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-cl:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-mark-expired-permits:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-licence-status-rules:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-last-tm-letter:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-international-goods-export:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-interim-end-date-enforcement:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-inspection-request-email:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-import-users-from-csv:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-flag-urgent-tasks:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-expire-bus-registration:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-enqueue-ch-compare:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-duplicate-vehicle-warning:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-digital-continuation-reminders:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-database-maintenance:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-precheck:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-postcheck:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-populate:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-delete:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-create-psv-licence-surrender-task:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-company-profile-dlq:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-cns:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-close-expired-windows:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-clean-up-variations:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-ch-vs-olcs-diffs:77",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-cancel-unsubmitted-bilateral:77",
                        ]
                      - Sid      = "batch"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "Name" = "vol-app-int-batch-scheduler-inline"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 6 to add, 2 to change, 0 to destroy.

```

</details>